# Chapter 6 Data Loading, Storage, and File Formats

In [3]:
# Import Series and DataFrame into local namespace
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Problem 1

#### In this problem, you will use read_csv to read ex1.csv as a file. Type in the code to read the file and display the contents. Look for ex1.csv from the Textbook Example files (zip format) in Week 4 Moodle. The ex1.csv file needs to be in the same folder as this file.

In [2]:
# Insert commenting and code in this cell.

#Assinging a variable to the read file.
df = pd.read_csv('ex1.csv')
#Displaying the contents.
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## Problem 2

#### In this problem, you will read text files in pieces. You will use ex6.csv (see problem 1 above on how to get these files). Let's make the pandas display settings more compact. Then read in ex6.csv and display the contents.

In [3]:
# Insert commenting and code in this cell.
#Assinging a variable to the read file.
result = pd.read_csv('ex6.csv')
#Making display settings more compact.
pd.options.display.max_rows = 10
#Displaying the contents.
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

# Run the following commands in the Anaconda prompt (before moving on to Problem 4). 
conda install lxml
pip install beautifulsoup4 html5lib

## Problem 3

#### In this problem, you will search an HTML file and display the contents. The file you will need is fdic_failed_bank_list.html.

In [5]:
# Insert commenting and code in this cell.
#Assinging a variable to the read file.
tables = pd.read_html('fdic_failed_bank_list.html')
#Displaying the contents.
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

## Problem 4

#### In this problem, you will create an instance of the ex1.xlsx Excel file. You will then read it into a DataFrame with parse and dislay the contents of Sheet1.

In [5]:
# Insert commenting and code in this cell.
#Creating an instance of the ex1.xlsx file.
xlsx = pd.ExcelFile('ex1.xlsx')
#Displaying the contents of the file.
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

# Chapter 7 Data Cleaning and Preparation

## Problem 5

#### In this problem, you will filter out missing data using dropna.<br>
Create a DataFrame with the following:<br>
[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]<br>
1) Set up DataFrame named data with the values above<br>
2) Display the contents of data<br>
Use a different input for the second part<br>
3) Set up a variable named cleaned which will call up data with the dropna method<br>
4) Display the contents of cleaned<br>

In [7]:
# Insert commenting and code in this cell.
#Importing lib.
from numpy import nan as NA
#Creating a dataframe.
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])
#Displaying the data variable.
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
#Cleaning the dataframe.
cleaned = data.dropna()
#Displaying the cleaned variable.
cleaned

     0    1    2
0  1.0  6.5  3.0

## Problem 6

#### In this problem, you will remove duplicates from a DataFrame named data.<br>
1) Create a dictionary called data with the key-value pairs presented below:<br>
k1: one, two, one, two, one, two, two<br>
k2: 1, 1, 2, 3, 3, 4, 4<br>
2) Display data<br>
3) Insert a new Input line<br>
4) Use the drop_duplicates() on data<br>
5) Display contents of data (with removal of duplicates)

In [7]:
# Insert commenting and code in this cell.
#Creating a dataframe dictionary.
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
#Displaying the contents.
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [8]:
#BEGIN drop_duplicates() FOR THE DATA AND DISPLAYING IT.
#Dropping duplicates for k1.
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

## Problem 7

#### In this problem, you will create a Series named data and replace values. 
1) Create a Series named data with tehf values - [1., -999., 2., -999., -1000., 3.]<br>
2) Display the contents of data<br>
3) Insert a new Input line<br>
4) Use the replace method to replace all instances of -999 with NaN<br>

In [10]:
# Insert commenting and code in this cell.
#Creating a series.
data = pd.Series([1., -999., 2., -999., -1000., 3.])
#Displaying the contents of the Series.
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [11]:
#Replacing the -999 with nan.
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

## Problem 8

#### In this problem, you will take a comma-separated string and break it into separate pieces using split.<br>
1) Create a string called val with 'a,b,johnson'<br>
2) Split the string named val into a separate set of pieces.

In [12]:
# Insert commenting and code in this cell.
#Creating a string.
val = "a,b,johnson"
#Splitting the string.
val.split(',')

['a', 'b', 'johnson']

# Chapter 8 Data Wrangling: Join, Combine, and Reshape

## Problem 9

#### In this problem, you will use a database-style DataFrame join. 
1) Create a dataFrame named df1 with the following: {'key': ['b', 'b', 'a', 'c, 'a', 'a', 'b'], 'data1': (range(7)<br>
2) Create a dataFrame named df2 with the following: {'key': ['a', 'b', 'd'], 'data2': (range(3)<br>
3) Display the contents of df1 and df2<br>
4) Steps 1 and 2 should be done in separate Input lines<br>
5) Create a merge on key - pd.merge(df1, df2, on='key')

In [14]:
# Insert commenting and code in this cell.
#BEGIN CONSTRUCTING TWO DATAFRAMES.
#Creating the first dataframe.
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})

In [15]:
#Creating the second dataframe.
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})
#DISPLAYING THE CONTENTS OF THE DATAFRAMES.
df1
df2
#Merging the objects and printing them out.
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

## Problem 10

#### In this problem, you will conduct replicate the Pivoting "Wide" to "Long" Format operation on textbook pages 253-254 under the heading "Pivoting "Wide" to "Long" Format. Stop after the melted operation (right before sentence "Using pivot, we can reshape...)

In [23]:
# Insert commenting and code in this cell.
#Creating a dataframe.
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                    'A': [1, 2, 3],
                    'B': [4, 5, 6],
                    'C': [7, 8, 9]})
#Printing the dataframe.
df
#Melting the keys onto the dateframe.
melted = pd.melt(df, ['key'])
#Printing melted.
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9